/****************************************************************************
 *
 *  api_timer.h                                      
 *  Created on: 2018/01/24
 *  Version: 1.0
 * 
*****************************************************************************/
#ifndef __API_TIMER_H__
#define __API_TIMER_H__

#ifdef __cplusplus 	
extern "C" { 
#endif

#include <stdint.h>

#define IN
#define OUT

#define API_TIMER_SUCCESS         0
#define API_TIMER_FAILED         -1

/*****************************************************************
** 函数名称: api_updatetime_thread
** 函数说明: 更新系统时间线程
** 入参列表:
**       --  cpu_id : 要绑定的cpu
** 出参列表:
**      --   无
** 返回类型: 
        --   
** 函数版本: 1.0
** 注意使用: 需要开启线程
*****************************************************************/
int32_t api_updatetime_thread(IN int32_t cpu_id);

/*****************************************************************
** 函数名称: api_sec_time_get
** 函数说明: 获取系统时间单位 s
** 入参列表:
**       --  无
** 出参列表:
**      --   无
** 返回类型:
        --   uint64_t
** 函数版本: 1.0
** 注意使用:  
*****************************************************************/
uint64_t api_sec_time_get(void);

/*****************************************************************
** 函数名称: api_ms_time_get
** 函数说明: 获取系统时间单位 ms
** 入参列表:
**       --  无
** 出参列表:
**      --   无
** 返回类型:
        --   uint64_t
** 函数版本: 1.0
** 注意使用:  
*****************************************************************/
uint64_t api_ms_time_get(void);

/*****************************************************************
** 函数名称: api_ms_time_get
** 函数说明: 获取系统时间单位 us
** 入参列表:
**       --  无
** 出参列表:
**      --   无
** 返回类型:
        --   uint64_t
** 函数版本: 1.0
** 注意使用:  
*****************************************************************/
uint64_t api_us_time_get(void);


#ifdef __cplusplus 	
}
#endif
#endif 
